Repository: LaShavi/IncidentManagementDotNetTechnicalTest
Catalog: Application/Resources/LocalizedStrings.*.resx
Languages: es

# LoginSuccess
source: Login successful
es: Login exitoso

source: Invalid credentials
es: Credenciales inválidas

# AccountDeactivated
source: Account is deactivated
es: La cuenta está desactivada

# AccountLocked
source: Account is locked until {0}
es: La cuenta está bloqueada hasta {0}

# UserRegisteredSuccess
source: User registered successfully
es: Usuario registrado exitosamente

source: Username already exists
es: El nombre de usuario ya existe

# EmailAlreadyRegistered
source: Email is already registered
es: El email ya está registrado

# TokenRefreshedSuccess
source: Token refreshed successfully
es: Token renovado exitosamente

# TokenRevokedSuccess
source: Token revoked successfully
es: Token revocado exitosamente

source: Invalid or expired token
es: Token inválido o expirado

# LogoutSuccess
source: Logout successful
es: Sesión cerrada exitosamente

source: User authenticated
es: Usuario autenticado

source: Invalid token
es: Token no válido

source: Token validation
es: Validación de token

source: Invalid user
es: Usuario no válido

# ProfileUpdatedSuccess
source: Profile updated successfully
es: Perfil actualizado correctamente

# PasswordChangedSuccess
source: Password changed successfully
es: Contraseña cambiada correctamente

source: Passwords do not match
es: Las contraseñas no coinciden

# CurrentPasswordIncorrect
source: Current password is incorrect
es: La contraseña actual es incorrecta

# ResetLinkSent
source: If the email exists, a reset link has been sent.
es: Si el email existe, se ha enviado un enlace de restablecimiento.

# PasswordResetSuccess
source: Password reset successfully
es: Contraseña restablecida correctamente

source: Invalid or expired reset token
es: Token de recuperación inválido o expirado

source: Password validation completed
es: Validación de contraseña completada

# EmailRequired
source: Email is required
es: El email es requerido

# PasswordRequired
source: Password is required
es: La contraseña es requerida

# PasswordPolicyViolation
source: Password does not meet security policies: {0}
es: La contraseña no cumple con las políticas de seguridad: {0}

source: User not found
es: Usuario no encontrado

# EmailInvalid
source: The email is invalid and not secure
es: El email no es válido y seguro

# UsernameInvalid
source: Username must be between 3-30 characters and not be a reserved word
es: El nombre de usuario debe tener entre 3-30 caracteres y no ser una palabra reservada

# NameInvalid
source: Name must contain only letters, spaces, accents, apostrophes and hyphens
es: El nombre debe contener solo letras, espacios, acentos, apostrofes y guiones

# TokenInvalid
source: Token must be valid in base64 or hexadecimal format
es: El token debe ser válido en formato base64 o hexadecimal

# PasswordRecommendation.VeryWeak.LongerPassword
source: Consider using a longer password (12+ characters)
es: Considera usar una contraseña más larga (12+ caracteres)

# PasswordRecommendation.VeryWeak.MixedCharacters
source: Mix uppercase, lowercase, numbers and symbols
es: Mezcla letras mayúsculas, minúsculas, números y símbolos

# PasswordRecommendation.VeryWeak.AvoidCommon
source: Avoid common words or personal information
es: Evita palabras comunes o información personal

# PasswordRecommendation.Weak.Strengthen
source: Your password is good, but you could make it stronger
es: Tu contraseña es buena, pero podrías fortalecerla más

# PasswordRecommendation.Weak.MoreSpecialChars
source: Consider adding more special characters
es: Considera agregar más caracteres especiales

# PasswordRecommendation.Strong.Excellent
source: Excellent! Your password is very secure
es: ¡Excelente! Tu contraseña es muy segura

# UsernameRequired
source: Username is required
es: El nombre de usuario es requerido

# PasswordLengthRequired
source: Password must be between 8 and 128 characters
es: La contraseña debe tener entre 8 y 128 caracteres

# PasswordConfirmationRequired
source: Password confirmation is required
es: La confirmación de contraseña es requerida

# FirstNameRequired
source: First name is required
es: El nombre es requerido

# LastNameRequired
source: Last name is required
es: El apellido es requerido

# TokenRequired
source: Recovery token is required
es: El token de recuperación es requerido

# NewPasswordRequired
source: New password is required
es: La nueva contraseña es requerida

# InvalidRequest
source: Invalid request: missing required parameters
es: Solicitud inválida: faltan parámetros requeridos

source: Invalid request parameters
es: Parámetros de solicitud inválidos

source: Unauthorized access
es: Acceso no autorizado

source: Resource not found
es: Recurso no encontrado

# InvalidOperation
source: Invalid operation in current state
es: Operación no válida en el estado actual

# TimeoutExceeded
source: Timeout exceeded - Please try again later
es: Tiempo de espera agotado - Intente más tarde

# OperationCanceled
source: Operation canceled - Please try again later
es: Operación cancelada - Intente más tarde

source: Operation not supported
es: Operación no soportada

# InternalServerError
source: An internal server error occurred
es: Ha ocurrido un error interno del servidor

# SupportReference
source: For support, contact with this reference ID
es: Para soporte, contacte con este ID de referencia

# ClienteCreated
source: Client created successfully
es: Cliente creado exitosamente

# ClienteUpdated
source: Client updated successfully
es: Cliente actualizado exitosamente

# ClienteDeleted
source: Client deleted successfully
es: Cliente eliminado exitosamente

# ClienteNotFound
source: Client not found
es: Cliente no encontrado

# IdMismatch
source: URL ID does not match DTO ID
es: El ID de la URL no coincide con el ID del DTO

# WelcomeEmailSubject
source: Welcome to our platform!
es: ¡Bienvenido a nuestra plataforma!

# EmailConfirmationSubject
source: Confirm your email address
es: Confirma tu dirección de correo electrónico

# PasswordResetSubject
source: Password Recovery
es: Recuperación de Contraseña

# PasswordChangedSubject
source: Your password has been changed
es: Tu contraseña ha sido cambiada

# ProfileUpdatedSubject
source: Profile Update
es: Actualización de Perfil

# AccountLockedSubject
source: Account Locked
es: Cuenta Bloqueada

# AccountDeletedSubject
source: Account Deleted
es: Cuenta Eliminada

# EmailWelcome.AccountCreatedTitle
source: Your account has been created successfully!
es: ¡Tu cuenta ha sido creada exitosamente!

# EmailWelcome.FullServiceAccess
source: You can now start using all our services and features.
es: Ya puedes comenzar a usar todos nuestros servicios y funcionalidades.

# EmailWelcome.BeginningStepsTitle
source: Some steps you can follow to get started:
es: Algunos pasos que puedes seguir para comenzar:

# EmailWelcome.CompleteProfile
source: Complete your profile with additional information
es: Completa tu perfil con información adicional

# EmailWelcome.ExploreFeatures
source: Explore the available features
es: Explora las funcionalidades disponibles

# EmailWelcome.ConfigurePreferences
source: Configure your personal preferences
es: Configura tus preferencias personales

# EmailWelcome.NeedHelp
source: If you have any questions or need help, do not hesitate to contact us.
es: Si tienes alguna pregunta o necesitas ayuda, no dudes en contactarnos.

# EmailWelcome.EnjoyExperience
source: Enjoy the experience!
es: ¡Que disfrutes la experiencia!

# EmailPasswordReset.RequestReceived
source: We have received a request to reset the password for your account.
es: Hemos recibido una solicitud para restablecer la contraseña de tu cuenta.

# EmailPasswordReset.TokenTitle
source: Recovery token:
es: Token de recuperación:

# EmailPasswordReset.ImportantInfo
source: Important information:
es: Información importante:

# EmailPasswordReset.ExpirationWarning
source: This token will expire in {0} hours for security reasons
es: Este token expirará en {0} horas por seguridad

# EmailPasswordReset.SingleUseOnly
source: It can only be used once
es: Solo puede ser usado una vez

# EmailPasswordReset.IgnoreIfNotRequested
source: If you did not request this change, you can ignore this email
es: Si no solicitaste este cambio, puedes ignorar este correo

# EmailPasswordReset.HowToReset
source: To reset your password, use the token shown above in the application.
es: Para restablecer tu contraseña, usa el token mostrado arriba en la aplicación.

# EmailPasswordReset.SecurityConcern
source: If you did not request this change or have any questions about the security of your account, please contact our support team immediately.
es: Si no solicitaste este cambio o tienes alguna pregunta sobre la seguridad de tu cuenta, por favor contacta inmediatamente a nuestro equipo de soporte.

# EmailConfirmation.ConfirmEmailRequest
source: To complete your registration, we need to confirm your email address.
es: Para completar tu registro, necesitamos confirmar tu dirección de correo electrónico.

# EmailConfirmation.ConfirmationTokenTitle
source: Confirmation token:
es: Token de confirmación:

# EmailConfirmation.UseTokenInstructions
source: Please use this token in the application to verify your account.
es: Por favor, usa este token en la aplicación para verificar tu cuenta.

# EmailConfirmation.TokenExpiration
source: This token will expire in {0} hours.
es: Este token expirará en {0} horas.

# EmailConfirmation.RequestNewToken
source: If the token expires, you will need to request a new one from the application.
es: Si el token expira, deberás solicitar uno nuevo desde la aplicación.

# EmailConfirmation.FullAccess
source: Once you confirm your email, you will have full access to all platform features.
es: Una vez confirmado tu correo electrónico, tendrás acceso completo a todas las funcionalidades de la plataforma.

# EmailConfirmation.IgnoreIfNotYou
source: If you did not create an account with us, you can ignore this email.
es: Si no creaste una cuenta con nosotros, puedes ignorar este correo.

# EmailPasswordChanged.NotificationTitle
source: Your password has been changed
es: Tu contraseña ha sido cambiada

# EmailPasswordChanged.ConfirmationMessage
source: We inform you that your password has been changed successfully on {0} at {1}.
es: Te informamos que tu contraseña ha sido cambiada exitosamente el {0} a las {1}.

# EmailPasswordChanged.ChangeConfirmed
source: Change confirmed
es: Cambio confirmado

# EmailPasswordChanged.AccountProtected
source: Your account is now protected with your new password.
es: Tu cuenta ahora está protegida con la nueva contraseña.

# EmailPasswordChanged.NotYou
source: Wasn't it you?
es: ¿No fuiste tú?

# EmailPasswordChanged.UnauthorizedAccess
source: If you did not make this change, your account could be compromised. Please:
es: Si no realizaste este cambio, tu cuenta podría estar comprometida. Por favor:

# EmailPasswordChanged.AdditionalSecurityMeasures
source: As an additional security measure, we recommend:
es: Como medida de seguridad adicional, te recomendamos:

# EmailPasswordChanged.UseStrongPasswords
source: Use unique and strong passwords
es: Usar contraseñas únicas y seguras

# EmailPasswordChanged.Enable2FA
source: Enable two-factor authentication if available
es: Habilitar autenticación de dos factores si está disponible

# EmailPasswordChanged.DontShareCredentials
source: Do not share your credentials with third parties
es: No compartir tus credenciales con terceros

# EmailProfileUpdated.ProfileUpdated
source: Your profile has been updated
es: Tu perfil ha sido actualizado

# EmailProfileUpdated.ConfirmationMessage
source: We confirm that your profile information has been updated successfully on {0} at {1}.
es: Te confirmamos que la información de tu perfil ha sido actualizada exitosamente el {0} a las {1}.

# EmailProfileUpdated.UpdateConfirmed
source: Update confirmed
es: Actualización confirmada

# EmailProfileUpdated.ChangesActive
source: The changes to your profile are now active in your account.
es: Los cambios en tu perfil ya están activos en tu cuenta.

# EmailProfileUpdated.NotYou
source: Wasn't it you?
es: ¿No fuiste tú?

# EmailProfileUpdated.UnauthorizedUpdate
source: If you did not make this update, we recommend:
es: Si no realizaste esta actualización, te recomendamos:

# EmailProfileUpdated.ReviewAccount
source: Review your account immediately
es: Revisar inmediatamente tu cuenta

# EmailProfileUpdated.ChangePassword
source: Change your password for security
es: Cambiar tu contraseña por seguridad

# EmailProfileUpdated.ContactSupport
source: Contact our support team
es: Contactar a nuestro equipo de soporte

# EmailAccountLocked.AccountLocked
source: Your account has been temporarily locked
es: Tu cuenta ha sido bloqueada temporalmente

# EmailAccountLocked.LockReason
source: due to multiple failed login attempts.
es: debido a múltiples intentos fallidos de inicio de sesión.

# EmailAccountLocked.SecurityMeasure
source: Security measure activated
es: Medida de seguridad activada

# EmailAccountLocked.ProtectionReason
source: This action was taken to protect your account from unauthorized access.
es: Esta acción se tomó para proteger tu cuenta de accesos no autorizados.

# EmailAccountLocked.UnlockTime
source: Your account will automatically unlock {0}.
es: Tu cuenta se desbloqueará automáticamente {0}.

# EmailAccountLocked.WhatToDo
source: What can you do?
es: ¿Qué puedes hacer?

# EmailAccountLocked.WaitForUnlock
source: Wait for the automatic unlock
es: Esperar hasta que se levante el bloqueo automáticamente

# EmailAccountLocked.ContactSupportForUnlock
source: Contact support if you need immediate unlock
es: Contactar a soporte si necesitas desbloqueo inmediato

# EmailAccountLocked.VerifyCredentials
source: Verify that you are using the correct credentials
es: Verificar que estés usando las credenciales correctas

# EmailAccountLocked.NotYou
source: Wasn't it you?
es: ¿No fuiste tú?

# EmailAccountLocked.UnauthorizedAttempt
source: If you did not try to access your account, this could indicate an unauthorized access attempt. We recommend:
es: Si no intentaste acceder a tu cuenta, esto podría indicar un intento de acceso no autorizado. Te recomendamos:

# EmailAccountDeleted.AccountDeleted
source: Your account has been deleted
es: Tu cuenta ha sido eliminada

# EmailAccountDeleted.DeletionConfirmation
source: We confirm that your account has been successfully deleted on {0} at {1}.
es: Te confirmamos que tu cuenta ha sido eliminada exitosamente el {0} a las {1}.

# EmailAccountDeleted.DeletionConfirmed
source: Deletion confirmed
es: Eliminación confirmada

# EmailAccountDeleted.DataRemoved
source: All your personal information has been removed from our systems in accordance with our privacy policies.
es: Toda tu información personal ha sido eliminada de nuestros sistemas de acuerdo con nuestras políticas de privacidad.

# EmailAccountDeleted.NotYou
source: Wasn't it you?
es: ¿No fuiste tú?

# EmailAccountDeleted.UnauthorizedDeletion
source: If you did not request the deletion of your account, this is very serious. Please:
es: Si no solicitaste la eliminación de tu cuenta, esto es muy grave. Por favor:

# EmailAccountDeleted.ContactImmediately
source: Contact our support team immediately
es: Contacta inmediatamente a nuestro equipo de soporte

# EmailAccountDeleted.WhatMeansDeletion
source: What does this mean?
es: ¿Qué significa esto?

# EmailAccountDeleted.NoAccess
source: You can no longer access your account
es: Ya no puedes acceder a tu cuenta

# EmailAccountDeleted.PermanentDeletion
source: Your data has been permanently deleted
es: Tus datos han sido eliminados permanentemente

# EmailAccountDeleted.RecreateAccount
source: If you wish to return, you will need to create a new account
es: Si deseas volver, deberás crear una nueva cuenta

# EmailAccountDeleted.Farewell
source: We are sorry to see you go. If you decide to return in the future, we will be here to welcome you again.
es: Lamentamos verte partir. Si en el futuro decides volver, estaremos aquí para recibirte nuevamente.

# EmailLayout.AutomaticMessage
source: This email was sent automatically, please do not reply to this message.
es: Este correo fue enviado automáticamente, por favor no respondas a este mensaje.

# EmailLayout.SupportContact
source: If you have any questions, contact our support: {0}
es: Si tienes alguna pregunta, contacta nuestro soporte: {0}

# EmailLayout.CopyRights
source: All rights reserved.
es: Todos los derechos reservados.

# EmailLayout.Farewell
source: Best regards,
es: Saludos cordiales,

# EmailLayout.TeamPrefix
source: The team at
es: El equipo de

# EmailWelcome.WelcomeMessage
source: We warmly welcome you to our platform.
es: Te damos la más cordial bienvenida a nuestra plataforma.

# EmailWelcome.WelcomeTitle
source: Welcome!
es: ¡Bienvenido!

# EmailWelcome.WelcomeHeading
source: Welcome, {0}!
es: ¡Bienvenido, {0}!

# EmailAccountDeleted.Title
source: Account Deleted
es: Cuenta eliminada

# EmailCommon.Greeting
source: Hello
es: Hola

# EmailAccountDeleted.ProvideDetails
source: Provide all the details you can remember
es: Proporciona todos los detalles que puedas recordar

# EmailAccountDeleted.VerifyOtherServices
source: Verify the security of your other online services
es: Verifica la seguridad de tus otros servicios online

# EmailAccountDeleted.QuestionAboutDeletion
source: If you have any questions about the deletion process, do not hesitate to contact us.
es: Si tienes alguna pregunta sobre el proceso de eliminación, no dudes en contactarnos.

# EmailAccountLocked.Title
source: Account Locked
es: Cuenta bloqueada

# EmailAccountLocked.BlockedIntro
source: Your account has been locked
es: Tu cuenta ha sido bloqueada

# EmailAccountLocked.ChangePasswordAfterUnlock
source: Change your password once the account is unlocked
es: Cambiar tu contraseña una vez que la cuenta sea desbloqueada

# EmailAccountLocked.ReviewActivity
source: Review recent activity on your account
es: Revisar la actividad reciente de tu cuenta

# EmailAccountLocked.ContactSecurityTeam
source: Contact our security team immediately
es: Contactar inmediatamente a nuestro equipo de seguridad

# EmailAccountLocked.ApologyMessage
source: We apologize for the inconvenience. This measure is necessary to maintain the security of your account.
es: Lamentamos las molestias. Esta medida es necesaria para mantener la seguridad de tu cuenta.

# EmailConfirmation.Title
source: Confirm your email address
es: Confirma tu correo electrónico

# EmailConfirmation.Heading
source: Email Confirmation
es: Confirmación de Correo Electrónico

# EmailPasswordChanged.Title
source: Password Changed
es: Contraseña cambiada

# EmailPasswordChanged.ContactSupport
source: Contact our support immediately
es: Contacta inmediatamente a nuestro soporte

# EmailPasswordChanged.ChangePasswordASAP
source: Change your password as soon as possible
es: Cambia tu contraseña lo antes posible

# EmailPasswordChanged.ReviewRecentActivity
source: Review recent activity on your account
es: Revisa la actividad reciente de tu cuenta

# EmailPasswordReset.Title
source: Password Recovery
es: Recuperación de Contraseña

# EmailPasswordReset.Heading
source: Password Recovery
es: Recuperación de Contraseña

# EmailProfileUpdated.Title
source: Profile Updated
es: Perfil actualizado

# EmailProfileUpdated.RememberUpdate
source: Remember that you can update your profile information at any time from your account settings.
es: Recuerda que puedes actualizar la información de tu perfil en cualquier momento desde la configuración de tu cuenta.

# EmailProfileUpdated.AnyQuestion
source: If you have any questions about the changes made, do not hesitate to contact us.
es: Si tienes alguna pregunta sobre los cambios realizados, no dudes en contactarnos.
